Initialize the lab by mounting the colab notebook to your google drive

In [ ]:
from google.colab import drive

In [ ]:
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

Example of Google Drive directory change

In [ ]:
%cd '/content/drive/My Drive/SI618/Labs/Lab1/Lab1'

/content/drive/My Drive/SI618/Labs/Lab1/Lab1

In [ ]:
%pwd

'/content/drive/My Drive/SI618/Labs/Lab1/Lab1'

In [ ]:
comics_df = pd.read_csv('comic_characters.csv')
comics_df

          id publisher  ...    year       date
0          1    Marvel  ...  1962.0   8/1/1962
1          2    Marvel  ...  1941.0   3/1/1941
2          3    Marvel  ...  1974.0  10/1/1974
3          4    Marvel  ...  1963.0   3/1/1963
4          5    Marvel  ...  1950.0  11/1/1950
...      ...       ...  ...     ...        ...
23267  23268        DC  ...     NaN        NaN
23268  23269        DC  ...     NaN        NaN
23269  23270        DC  ...     NaN        NaN
23270  23271        DC  ...     NaN        NaN
23271  23272        DC  ...     NaN        NaN

[23272 rows x 14 columns]

<font color='red'>To-do:</font> Insert a code cell and change your directory to your 618 materials in your google drive

In [1]:
%pwd

'C:\\Users\\matte\\Documents\\Fall_2020\\SI618\\Labs\\Lab1'

Let's start by important the appropriate libraries.

In [ ]:
import pandas as pd

In [ ]:
import numpy as np

<font color='red'>To-do:</font> Insert a cell in markdown mode and write "This is a markdown example" in italics.

*This is a markdown example*

### Initialization
You can create a Series by passing a list of values. By default, pandas will create an integer index.

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Let's create another Series

In [ ]:
s2 = pd.Series(["1", "10", "3", "44"])

In [ ]:
s3 = pd.Series(["3","4","5"])
s3

0    3
1    4
2    5
dtype: object

<font color='red'>To-do:</font> Insert a new cell above this one and create a new series called s3. You can choose its datatype, size, and elements. Display the result.

<font color='red'>To-do:</font> If you aim to store integers, string is an inefficient data type. Let's convert this series to the appropriate data type and store the result in s4. Display s4.

In [ ]:
s4 = s3.astype(int) 
s4

0    3
1    4
2    5
dtype: int64

You can also use pandas to create a series of datetime objects. Let’s make one for the week beginning January 25th, 2015:

In [ ]:
dates = pd.date_range('20150125',periods=7)
dates

DatetimeIndex(['2015-01-25', '2015-01-26', '2015-01-27', '2015-01-28',
               '2015-01-29', '2015-01-30', '2015-01-31'],
              dtype='datetime64[ns]', freq='D')

<font color='red'>To-do:</font> Insert a new cell below this one and create a new dates2 DatetimeIndex object that starts June 20, 2020, ends with September June 25, 2020 and has five periods. Display the result.

In [ ]:
dates2 = pd.date_range('20200620', periods=6)
dates2

DatetimeIndex(['2020-06-20', '2020-06-21', '2020-06-22', '2020-06-23',
               '2020-06-24', '2020-06-25'],
              dtype='datetime64[ns]', freq='D')

Now we’ll create a DataFrame using the dates array as our index, fill it with some random values using numpy, and give the columns some labels.

In [ ]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=['col1','col2','col4','col3'])
df

                col1      col2      col4      col3
2015-01-25  1.564875 -0.725519 -0.057454  1.354353
2015-01-26 -0.960898  1.079153 -0.604003 -0.374604
2015-01-27  0.126515 -0.039990  0.980736 -0.024053
2015-01-28  0.274226 -1.205027  0.208078 -0.397373
2015-01-29 -0.656086  1.297950 -1.106321 -0.425682
2015-01-30 -1.108514  2.036246 -0.897039  0.510048
2015-01-31  1.447753  0.678568  0.891840 -1.391308

<font color='red'>To-do:</font> Now create df2 that uses dates2 as its index. Use the same set of columns ('col1','col2','col4','col3').

In [ ]:
df2 = pd.DataFrame(np.random.randn(6,4), index=dates2, columns=['col1','col2','col4','col3'])
df2

                col1      col2      col4      col3
2020-06-20 -0.948846 -0.190776  0.501428  0.337071
2020-06-21 -1.738417  1.301884  0.315584 -0.128826
2020-06-22 -0.218879  0.778140  0.351289  1.266331
2020-06-23 -0.943901  0.516603 -0.973039 -1.060605
2020-06-24  1.649108  1.079079  0.195677  1.664510
2020-06-25 -0.870948  0.549581  0.283376  0.178529

It can also be useful to know how to create a DataFrame from a dict of objects. This comes in particularly handy when working with JSON-like structures.

In [ ]:
df3 = pd.DataFrame({ 'A' : 1.,
                            'B' : pd.Timestamp('20130102'),
                            'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                            'D' : np.array([3] * 4,dtype='int32'),
                            'E' : pd.Categorical(["test","train","test","train"]),
                            'F' : 'foo' })
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

<font color='red'>To-do:</font> Below we are trying to create another DataFrame df4. But there are some mistakes. Correct these mistakes to make sure the code compiles. Do not edit column c2.

In [ ]:
df4 = pd.DataFrame({ "c1" : [1,2,3,4],
                       "c2": [1,3,3,"book"],
                       "c3": ["True","False","True","False"]})
df4

   c1    c2     c3
0   1     1   True
1   2     3  False
2   3     3   True
3   4  book  False

<font color='red'>To-do:</font> Print out the datatypes of columns in df4.

In [ ]:
df4.dtypes

c1     int64
c2    object
c3    object
dtype: object

What do you see for c2? You can see that pandas tries to find a common object type. This is great but this flexibility can also result in runtime errors.  Make sure you are careful with the use of data types.

### Exploring data in a DataFrame
We can access the data types of each column in a DataFrame as follows:

In [ ]:
df.index

DatetimeIndex(['2015-01-25', '2015-01-26', '2015-01-27', '2015-01-28',
               '2015-01-29', '2015-01-30', '2015-01-31'],
              dtype='datetime64[ns]', freq='D')

A few other basic operations:

In [ ]:
df.values

array([[ 1.56487455, -0.72551907, -0.05745362,  1.35435328],
       [-0.96089847,  1.07915346, -0.60400323, -0.37460446],
       [ 0.12651508, -0.03999034,  0.98073562, -0.02405304],
       [ 0.27422632, -1.205027  ,  0.20807768, -0.39737255],
       [-0.65608606,  1.29794976, -1.1063212 , -0.4256824 ],
       [-1.10851404,  2.03624558, -0.89703854,  0.51004774],
       [ 1.4477534 ,  0.67856796,  0.8918402 , -1.39130815]])

In [ ]:
df.describe()

           col1      col2      col4      col3
count  7.000000  7.000000  7.000000  7.000000
mean   0.098267  0.445911 -0.083452 -0.106946
std    1.091712  1.157886  0.831516  0.859274
min   -1.108514 -1.205027 -1.106321 -1.391308
25%   -0.808492 -0.382755 -0.750521 -0.411527
50%    0.126515  0.678568 -0.057454 -0.374604
75%    0.860990  1.188552  0.549959  0.242997
max    1.564875  2.036246  0.980736  1.354353

<font color='red'>To-do:</font> Print the column names for df.

In [ ]:
list(df.columns)

['col1', 'col2', 'col4', 'col3']

### Some basic data transformations
DataFrames have a built-in transpose

In [ ]:
df.T

      2015-01-25  2015-01-26  2015-01-27  ...  2015-01-29  2015-01-30  2015-01-31
col1    1.564875   -0.960898    0.126515  ...   -0.656086   -1.108514    1.447753
col2   -0.725519    1.079153   -0.039990  ...    1.297950    2.036246    0.678568
col4   -0.057454   -0.604003    0.980736  ...   -1.106321   -0.897039    0.891840
col3    1.354353   -0.374604   -0.024053  ...   -0.425682    0.510048   -1.391308

[4 rows x 7 columns]

We can also sort a DataFrame along a given data dimension. For example, we might want to sort by the values in the second column:

In [ ]:
df.sort_values(by=['col2'])

                col1      col2      col4      col3
2015-01-28  0.274226 -1.205027  0.208078 -0.397373
2015-01-25  1.564875 -0.725519 -0.057454  1.354353
2015-01-27  0.126515 -0.039990  0.980736 -0.024053
2015-01-31  1.447753  0.678568  0.891840 -1.391308
2015-01-26 -0.960898  1.079153 -0.604003 -0.374604
2015-01-29 -0.656086  1.297950 -1.106321 -0.425682
2015-01-30 -1.108514  2.036246 -0.897039  0.510048

We can also sort the rows (axis = 0) by their index values:

In [ ]:
df.sort_index(axis=0, ascending=False)

                col1      col2      col4      col3
2015-01-31  1.447753  0.678568  0.891840 -1.391308
2015-01-30 -1.108514  2.036246 -0.897039  0.510048
2015-01-29 -0.656086  1.297950 -1.106321 -0.425682
2015-01-28  0.274226 -1.205027  0.208078 -0.397373
2015-01-27  0.126515 -0.039990  0.980736 -0.024053
2015-01-26 -0.960898  1.079153 -0.604003 -0.374604
2015-01-25  1.564875 -0.725519 -0.057454  1.354353

<font color='red'>To-do:</font> Sort df according to column header values using df.sort_index.

In [ ]:
df.sort_index(1, ascending=True)

                col1      col2      col3      col4
2015-01-25  1.564875 -0.725519  1.354353 -0.057454
2015-01-26 -0.960898  1.079153 -0.374604 -0.604003
2015-01-27  0.126515 -0.039990 -0.024053  0.980736
2015-01-28  0.274226 -1.205027 -0.397373  0.208078
2015-01-29 -0.656086  1.297950 -0.425682 -1.106321
2015-01-30 -1.108514  2.036246  0.510048 -0.897039
2015-01-31  1.447753  0.678568 -1.391308  0.891840

### Selection
To select only only the first few rows of a DataFrame, use the .head() function, or tail to get the last few rows. These functions by default return 5 rows but you can change that.

In [ ]:
df.head()

                col1      col2      col4      col3
2015-01-25  1.564875 -0.725519 -0.057454  1.354353
2015-01-26 -0.960898  1.079153 -0.604003 -0.374604
2015-01-27  0.126515 -0.039990  0.980736 -0.024053
2015-01-28  0.274226 -1.205027  0.208078 -0.397373
2015-01-29 -0.656086  1.297950 -1.106321 -0.425682

<font color='red'>To-do:</font> Get the last 2 rows in df.

In [ ]:
df.tail(n=2)

                col1      col2      col4      col3
2015-01-30 -1.108514  2.036246 -0.897039  0.510048
2015-01-31  1.447753  0.678568  0.891840 -1.391308

Selecting a single column yields a Series, equivalent to df.col1:

In [ ]:
df['col1']

2015-01-25    1.564875
2015-01-26   -0.960898
2015-01-27    0.126515
2015-01-28    0.274226
2015-01-29   -0.656086
2015-01-30   -1.108514
2015-01-31    1.447753
Freq: D, Name: col1, dtype: float64

We can also select a subset of the rows using slicing. You can select either by integer indexing or by value:

In [ ]:
df[1:3]

                col1      col2      col4      col3
2015-01-26 -0.960898  1.079153 -0.604003 -0.374604
2015-01-27  0.126515 -0.039990  0.980736 -0.024053

In [ ]:
df['20150127':'20150130']

                col1      col2      col4      col3
2015-01-27  0.126515 -0.039990  0.980736 -0.024053
2015-01-28  0.274226 -1.205027  0.208078 -0.397373
2015-01-29 -0.656086  1.297950 -1.106321 -0.425682
2015-01-30 -1.108514  2.036246 -0.897039  0.510048

To select more than one column at a time, try .loc[]):

In [ ]:
df.loc[:,['col2','col4']]

                col2      col4
2015-01-25 -0.725519 -0.057454
2015-01-26  1.079153 -0.604003
2015-01-27 -0.039990  0.980736
2015-01-28 -1.205027  0.208078
2015-01-29  1.297950 -1.106321
2015-01-30  2.036246 -0.897039
2015-01-31  0.678568  0.891840

You can select on rows and columns at the same time:

<font color='red'>To-do:</font> You can select on rows and columns at the same time. Select rows from '20150125' through '20150127' and columns col2, col3, and col4.

In [ ]:
df['20150125':'20150127'].loc[:,['col2', 'col3', 'col4']]

                col2      col3      col4
2015-01-25 -0.725519  1.354353 -0.057454
2015-01-26  1.079153 -0.374604 -0.604003
2015-01-27 -0.039990 -0.024053  0.980736

You can also use boolean indexing to select subset of a dataframe that satisfies a requirement

In [ ]:
df[df['col1'] > 0]

                col1      col2      col4      col3
2015-01-25  1.564875 -0.725519 -0.057454  1.354353
2015-01-27  0.126515 -0.039990  0.980736 -0.024053
2015-01-28  0.274226 -1.205027  0.208078 -0.397373
2015-01-31  1.447753  0.678568  0.891840 -1.391308

<font color='red'>To-do:</font> Now select the rows where both col2 and col3 are greater than zero.

In [ ]:
df[df > 0].loc[:,['col2','col3']]

                col2      col3
2015-01-25       NaN  1.354353
2015-01-26  1.079153       NaN
2015-01-27       NaN       NaN
2015-01-28       NaN       NaN
2015-01-29  1.297950       NaN
2015-01-30  2.036246  0.510048
2015-01-31  0.678568       NaN

In [ ]:
nonneg_only = df[df > 0]

In [ ]:
nonneg_only

                col1      col2      col4      col3
2015-01-25  1.564875       NaN       NaN  1.354353
2015-01-26       NaN  1.079153       NaN       NaN
2015-01-27  0.126515       NaN  0.980736       NaN
2015-01-28  0.274226       NaN  0.208078       NaN
2015-01-29       NaN  1.297950       NaN       NaN
2015-01-30       NaN  2.036246       NaN  0.510048
2015-01-31  1.447753  0.678568  0.891840       NaN

You can drop rows with missing values as such:

In [ ]:
nonneg_only.dropna()

Empty DataFrame
Columns: [col1, col2, col4, col3]
Index: []

There were no rows with no missing values (most likely, these are random numbers after all...) and therefore the result is an empty dataframe. You can instead assign a default value (here, 0) to the NaN values

In [ ]:
nonneg_only.fillna(value=0)

                col1      col2      col4      col3
2015-01-25  1.564875  0.000000  0.000000  1.354353
2015-01-26  0.000000  1.079153  0.000000  0.000000
2015-01-27  0.126515  0.000000  0.980736  0.000000
2015-01-28  0.274226  0.000000  0.208078  0.000000
2015-01-29  0.000000  1.297950  0.000000  0.000000
2015-01-30  0.000000  2.036246  0.000000  0.510048
2015-01-31  1.447753  0.678568  0.891840  0.000000

You can also do filtering using non-numeric values:

In [ ]:
df_c = df.copy()
df_c['color'] = ['red', 'blue', 'red', 'red', 'blue', 'green', 'green' ]
df_c

                col1      col2      col4      col3  color
2015-01-25  1.564875 -0.725519 -0.057454  1.354353    red
2015-01-26 -0.960898  1.079153 -0.604003 -0.374604   blue
2015-01-27  0.126515 -0.039990  0.980736 -0.024053    red
2015-01-28  0.274226 -1.205027  0.208078 -0.397373    red
2015-01-29 -0.656086  1.297950 -1.106321 -0.425682   blue
2015-01-30 -1.108514  2.036246 -0.897039  0.510048  green
2015-01-31  1.447753  0.678568  0.891840 -1.391308  green

In [ ]:
df_c[df_c['color'].isin(['red','blue'])]

                col1      col2      col4      col3 color
2015-01-25  1.564875 -0.725519 -0.057454  1.354353   red
2015-01-26 -0.960898  1.079153 -0.604003 -0.374604  blue
2015-01-27  0.126515 -0.039990  0.980736 -0.024053   red
2015-01-28  0.274226 -1.205027  0.208078 -0.397373   red
2015-01-29 -0.656086  1.297950 -1.106321 -0.425682  blue

### Combining DataFrames
You can combine DataFrame objects using simple concatenation (provided they have the same columns):

In [ ]:
frame_one = pd.DataFrame(np.random.randn(5, 4))
frame_one

          0         1         2         3
0  0.998476 -0.908846 -1.096042 -0.500010
1  1.794099  0.549975  0.468057  0.588933
2 -0.553925  0.495150  0.733065  0.200128
3 -1.075808  0.579653  1.872075  1.630708
4 -2.525866 -0.079282 -1.797402  1.182997

In [ ]:
frame_two = pd.DataFrame(np.random.randn(5, 4))
frame_two

          0         1         2         3
0 -0.157326  1.565873 -2.449857 -0.497764
1  0.649710 -2.276906  0.208842 -1.239984
2 -0.001026 -0.012283  0.079018 -0.679580
3  1.518198  0.206262  1.818150  0.411334
4 -1.464069 -1.111499  1.084301 -1.150738

In [ ]:
pd.concat([frame_one, frame_two])

          0         1         2         3
0  0.998476 -0.908846 -1.096042 -0.500010
1  1.794099  0.549975  0.468057  0.588933
2 -0.553925  0.495150  0.733065  0.200128
3 -1.075808  0.579653  1.872075  1.630708
4 -2.525866 -0.079282 -1.797402  1.182997
0 -0.157326  1.565873 -2.449857 -0.497764
1  0.649710 -2.276906  0.208842 -1.239984
2 -0.001026 -0.012283  0.079018 -0.679580
3  1.518198  0.206262  1.818150  0.411334
4 -1.464069 -1.111499  1.084301 -1.150738

<font color='red'>To-do:</font> Now concatenate along the other axis.

In [135]:
pd.concat([frame_one, frame_two], axis=1)

          0         1         2  ...         1         2         3
0  0.998476 -0.908846 -1.096042  ...  1.565873 -2.449857 -0.497764
1  1.794099  0.549975  0.468057  ... -2.276906  0.208842 -1.239984
2 -0.553925  0.495150  0.733065  ... -0.012283  0.079018 -0.679580
3 -1.075808  0.579653  1.872075  ...  0.206262  1.818150  0.411334
4 -2.525866 -0.079282 -1.797402  ... -1.111499  1.084301 -1.150738

[5 rows x 8 columns]

<font color='red'>To-do:</font> Do you see an issue here? What do you think we need to do to avoid this problem?

Issue: The numeric row names repeat themselves, need to ignore index

In [136]:
pd.concat([frame_one, frame_two], axis=1, ignore_index=True)

          0         1         2  ...         5         6         7
0  0.998476 -0.908846 -1.096042  ...  1.565873 -2.449857 -0.497764
1  1.794099  0.549975  0.468057  ... -2.276906  0.208842 -1.239984
2 -0.553925  0.495150  0.733065  ... -0.012283  0.079018 -0.679580
3 -1.075808  0.579653  1.872075  ...  0.206262  1.818150  0.411334
4 -2.525866 -0.079282 -1.797402  ... -1.111499  1.084301 -1.150738

[5 rows x 8 columns]

You can also perform SQL-like merge operations

In [ ]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [ ]:
right = pd.DataFrame({'key': ['foo', 'foo', 'bar'], 'rval': [3, 4, 5]}) 
right

   key  rval
0  foo     3
1  foo     4
2  bar     5

In [ ]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     3
1  foo     1     4
2  bar     2     5

### Grouping
Sometimes you will want to group and summarize a DataFrame for a more efficient computation. This is one of the strengths of pandas and DataFrames.

In [ ]:
foo_bar = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                                   'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                                   'C' : np.random.randn(8),
                                   'D' : np.random.randn(8)})
foo_bar

     A      B         C         D
0  foo    one  1.129071 -0.008190
1  bar    one  0.945881 -0.492358
2  foo    two -0.570459  0.504724
3  bar  three -0.691665 -0.543786
4  foo    two -0.307166  0.691543
5  bar    two  1.494821 -1.891736
6  foo    one -1.132897  0.239728
7  foo  three  2.097200 -1.513888

In [138]:
grouped = foo_bar.groupby('A').sum()
grouped

            C         D
A
bar  1.749037 -2.927880
foo  1.215750 -0.086083

<font color='red'>To-do:</font> What happened to column B? Because sum oepration cannot be applied to datatype string, the column was dropped here. Now use both columns to perform the operation for each possible A, B pair. Assin this to "grouped" and display it.

In [141]:
grouped = foo_bar.groupby(['A','B']).sum()
grouped

                  C         D
A   B
bar one    0.945881 -0.492358
    three -0.691665 -0.543786
    two    1.494821 -1.891736
foo one   -0.003826  0.231538
    three  2.097200 -1.513888
    two   -0.877625  1.196267

The .stack() function can be used to compress a level in the DataFrame’s columns:

In [ ]:
stacked = grouped.stack()
stacked

A
bar  C    1.749037
     D   -2.927880
foo  C    1.215750
     D   -0.086083
dtype: float64

In [ ]:
stacked.unstack()

            C         D
A
bar  1.749037 -2.927880
foo  1.215750 -0.086083

## Reading from/Writing to files
You can write a dataframe to file as follows:

In [142]:
grouped.to_csv('grouped.csv')

<font color='red'>To-do:</font> Now write this same DataFrame to a JSON file.

In [ ]:
grouped.to_json('grouped.json')

And you can read as follows:

In [144]:
new_frame = pd.read_csv('grouped.csv')

In [ ]:
new_frame.head()

     A         C         D
0  bar  1.749037 -2.927880
1  foo  1.215750 -0.086083

Let's now work with a relatively more complex and bigger file

In [ ]:
comics_df = pd.read_csv('comic_characters.csv')
comics_df

          id publisher  ...    year       date
0          1    Marvel  ...  1962.0   8/1/1962
1          2    Marvel  ...  1941.0   3/1/1941
2          3    Marvel  ...  1974.0  10/1/1974
3          4    Marvel  ...  1963.0   3/1/1963
4          5    Marvel  ...  1950.0  11/1/1950
...      ...       ...  ...     ...        ...
23267  23268        DC  ...     NaN        NaN
23268  23269        DC  ...     NaN        NaN
23269  23270        DC  ...     NaN        NaN
23270  23271        DC  ...     NaN        NaN
23271  23272        DC  ...     NaN        NaN

[23272 rows x 14 columns]

In [ ]:
comic_df = pd.read_csv('comic_characters.csv',
parse_dates=['date'], dayfirst=False, index_col='id')
comic_df

      publisher                                 name  ...    year       date
id                                                    ...
1        Marvel            Spider-Man (Peter Parker)  ...  1962.0 1962-08-01
2        Marvel      Captain America (Steven Rogers)  ...  1941.0 1941-03-01
3        Marvel  Wolverine (James \"Logan\" Howlett)  ...  1974.0 1974-10-01
4        Marvel    Iron Man (Anthony \"Tony\" Stark)  ...  1963.0 1963-03-01
5        Marvel                  Thor (Thor Odinson)  ...  1950.0 1950-11-01
...         ...                                  ...  ...     ...        ...
23268        DC              Nadine West (New Earth)  ...     NaN        NaT
23269        DC           Warren Harding (New Earth)  ...     NaN        NaT
23270        DC         William Harrison (New Earth)  ...     NaN        NaT
23271        DC         William McKinley (New Earth)  ...     NaN        NaT
23272        DC                   Mookie (New Earth)  ...     NaN        NaT

[23272 rows x 13 columns]

The goal of this lab was to provide a high level introduction to pandas. There is so much more to it. You can/should practice more. We will cover more in lecture #2.